same for me.
```
data "aws_ssm_parameter" "public_key_pem" {
  name = "cf_keypair_public"
}

resource "aws_cloudfront_public_key" "cf_key" {
	encoded_key = data.aws_ssm_parameter.public_key_pem.value
}

# note the random name
resource "aws_cloudfront_key_group" "cf_keygroup" {
	items = [aws_cloudfront_public_key.cf_key.id]
	name  = "cf_keygroup"
}

```

this cause  on each run  replacement 


```
  # module.cloudfront.aws_cloudfront_key_group.cf_keygroup will be updated in-place
  ~ resource "aws_cloudfront_key_group" "cf_keygroup" {
        id    = "1fc5f010-dddd-4323-dddd-6adddd2bcfb"
      ~ items = [
          - "KRXXXXXXXXAAW",
        ] -> (known after apply)
        name  = "cf_keygroup"
        # (1 unchanged attribute hidden)
    }

  # module.cloudfront.aws_cloudfront_public_key.cf_key must be replaced
-/+ resource "aws_cloudfront_public_key" "cf_key" {
      ~ caller_reference = "terraform-20231017141146946400000002" -> (known after apply)
      - comment          = "" -> null
      ~ encoded_key      = (sensitive) # forces replacement
      ~ etag             = "E5A885S6HGD8O" -> (known after apply)
      ~ id               = "KRXXXXXXXXAAW" -> (known after apply)
      ~ name             = "tf-20231017141146946300000001" -> (known after apply)
      + name_prefix      = (known after apply)


```




